Revit 2015 API
FormatOptions Properties
The FormatOptions type exposes the following members.
Properties
Name | Description
Accuracy
 The accuracy to which values will be rounded.
DisplayUnits
 The units and display format used to format values.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SuppressLeadingZeros
 Indicates if leading zeros should be suppressed in feet and fractional inches.
SuppressSpaces
 Indicates if spaces around the dash should be suppressed in feet and fractional inches.
SuppressTrailingZeros
 Indicates if trailing zeros after the decimal point should be suppressed.
UnitSymbol
 The unit symbol that should be displayed to indicate the units of the value.
UseDefault
 Indicates whether default or custom formatting should be used.
UseDigitGrouping
 Indicates if digit grouping symbols should be displayed.
UseGrouping |  Obsolete.
 Indicates if digit grouping symbols should be displayed.
UsePlusPrefix
 Indicates if a plus sign prefix should be displayed for positive and zero values.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace